Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 2592000,
                                    ]
                                  - type   = "lt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "A",
                                    ]
                                }
                              - reducer   = {
                                  - type = "avg"
                                }
                            },
                        ]
                      - refId      = "B"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Sockets used per node alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Sockets used per node alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "Sockets used per node alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "174"
              - "__dashboardUid__" = "GGodmXAVz"
              - "__panelId__"      = "2"
              - "message"          = "Sockets used per node has reached an unusually high level."
            } -> null
          - condition      = "A" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "15m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "e5600b97-49cc-4daa-9016-5bae3c84a365"
            } -> null
          - name           = "Sockets used per node alert" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "fdcru951njs3kb" -> null

          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "E",
                                    ]
                                }
                              - reducer   = {
                                  - type = "avg"
                                }
                            },
                        ]
                      - refId      = "A"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - datasource   = {
                          - type = "prometheus"
                          - uid  = "prometheus"
                        }
                      - editorMode   = "code"
                      - exemplar     = true
                      - expr         = "avg(node_sockstat_sockets_used{}) - (avg_over_time(avg(node_sockstat_sockets_used{})[24h:1m]) + 3 * stddev_over_time(avg(node_sockstat_sockets_used{})[24h:1m]))"
                      - instant      = false
                      - interval     = ""
                      - legendFormat = "alert"
                      - refId        = "E"
                    }
                ) -> null
              - ref_id         = "E" -> null

              - relative_time_range {
                  - from = 300 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Subnet IP usage alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Subnet IP usage alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "Subnet IP usage alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "153"
              - "__dashboardUid__" = "1NxY8ypGk"
              - "__panelId__"      = "2"
              - "message"          = "One or more subnets has a low count of available IP's < 500."
            } -> null
          - condition      = "B" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "a3f8e90a-b38b-4244-9d38-c70cfe05d477"
            } -> null
          - name           = "Subnet IP usage alert" -> null
          - no_data_state  = "OK" -> null
          - uid            = "fdcru94zhwrggf" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - expr         = "sum by(tag, subnetid) (aws_subnet_exporter_available_ip{tag=~\".*eu.*\"}) "
                      - interval     = ""
                      - legendFormat = "availableIP:{{tag}}"
                      - refId        = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 3600 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 500,
                                    ]
                                  - type   = "lt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "A",
                                    ]
                                }
                              - reducer   = {
                                  - type = "avg"
                                }
                            },
                        ]
                      - refId      = "B"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Topic has large amount of consumergroups.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Topic has large amount of consumergroups" -> null
      - interval_seconds   = 60 -> null
      - name               = "Topic has large amount of consumergroups" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "166"
              - "__dashboardUid__" = "CoYn_3-nk"
              - "__panelId__"      = "4"
              - "message"          = "A topic has large amount of consumergroups. This might be due to someone creating unique consumergroups and hence eventually taking down the exporter for everybody, due to long request times."
            } -> null
          - condition      = "B" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "c65dff93-ab8b-4f37-9670-e12fe4f26c75"
            } -> null
          - name           = "Topic has large amount of consumergroups" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "edcru9451nbpce" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - datasource   = {
                          - type = "prometheus"
                          - uid  = "prometheus"
                        }
                      - exemplar     = true
                      - expr         = "count(kafka_consumergroup_lag) by (topic)"
                      - interval     = ""
                      - legendFormat = "{{topic}}"
                      - refId        = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 300 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 150,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "A",
                                    ]
                                }
                              - reducer   = {
                                  - type = "avg"
                                }
                            },
                        ]
                      - refId      = "B"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/VPC CNI unavailable alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:VPC CNI unavailable alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "VPC CNI unavailable alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "170"
              - "__dashboardUid__" = "bj5-ZEhWk"
              - "__panelId__"      = "4"
              - "message"          = "One more instances of VPC CNI are unavailable! Please see \"Kubernetes Components\" dashboard for more details."
            } -> null
          - condition      = "A" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "1m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "c8f6677c-18dc-423a-bc2a-191514348b6f"
            } -> null
          - name           = "VPC CNI unavailable alert" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "cdcru94b0elfkb" -> null

          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0.5,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "B",
                                    ]
                                }
                              - reducer   = {
                                  - type = "avg"
                                }
                            },
                        ]
                      - refId      = "A"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - expr           = "sum by (daemonset) (kube_daemonset_status_desired_number_scheduled{namespace=\"kube-system\", daemonset=\"aws-node\"}) - sum by (daemonset) (kube_daemonset_status_number_available{namespace=\"kube-system\", daemonset=\"aws-node\"})"
                      - format         = "time_series"
                      - intervalFactor = 2
                      - legendFormat   = "Unavailable"
                      - refId          = "B"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 300 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Version alerts alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Version alerts alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "Version alerts alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "161"
              - "__dashboardUid__" = "YMBzktpGz"
              - "__panelId__"      = "15"
              - "message"          = "Current Kubernetes cluster version is outdated"
            } -> null
          - condition      = "B" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "repeat"   = "24h"
              - "rule_uid" = "b3144065-3094-4403-93dd-b7037b9f563d"
            } -> null
          - name           = "Version alerts alert" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "bdcru93b2v6dcb" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - datasource     = {
                          - type = "prometheus"
                          - uid  = "prometheus"
                        }
                      - expr           = "eks_version_exporter_is_outdated"
                      - format         = "time_series"
                      - instant        = false
                      - intervalFactor = 1
                      - legendFormat   = "is_outdated"
                      - refId          = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 60 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0.9,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "A",
                                    ]
                                }
                              - reducer   = {
                                  - type = "last"
                                }
                            },
                        ]
                      - refId      = "B"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Volume Snapshot Failure alert.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Volume Snapshot Failure alert" -> null
      - interval_seconds   = 60 -> null
      - name               = "Volume Snapshot Failure alert" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {
              - "__alertId__"      = "183"
              - "__dashboardUid__" = "YAniUGC"
              - "__panelId__"      = "34"
              - "message"          = "A volume snapshot using Velero has failed.  Please check Velero to establish the cause of the failure."
            } -> null
          - condition      = "B" -> null
          - exec_err_state = "Alerting" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "rule_uid" = "b8eaf085-5c81-4d2a-b4a7-f2c6c9998e66"
            } -> null
          - name           = "Volume Snapshot Failure alert" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "ddcru958129z4a" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - expr         = "rate(velero_volume_snapshot_failure_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      - interval     = ""
                      - legendFormat = ""
                      - refId        = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 300 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "A",
                                    ]
                                }
                              - reducer   = {
                                  - type = "last"
                                }
                            },
                        ]
                      - refId      = "B"
                      - type       = "classic_conditions"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 0 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.alerts.grafana_rule_group.alertrule["alertrules/Watchdog.json"] will be destroyed
  # (because module.alerts is not in configuration)
  - resource "grafana_rule_group" "alertrule" {
      - disable_provenance = false -> null
      - folder_uid         = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - id                 = "0:b934e728-bb75-170b-83e7-024c5bdd6e61:Watchdog" -> null
      - interval_seconds   = 300 -> null
      - name               = "Watchdog" -> null
      - org_id             = "1" -> null

      - rule {
          - annotations    = {} -> null
          - condition      = "C" -> null
          - exec_err_state = "Error" -> null
          - for            = "5m0s" -> null
          - is_paused      = false -> null
          - labels         = {
              - "repeat" = "24h"
            } -> null
          - name           = "Watchdog" -> null
          - no_data_state  = "NoData" -> null
          - uid            = "fdcru94bd4934b" -> null

          - data {
              - datasource_uid = "grafanacloud-prom" -> null
              - model          = jsonencode(
                    {
                      - editorMode = "code"
                      - expr       = "vector(1)"
                      - hide       = false
                      - instant    = true
                      - range      = false
                      - refId      = "A"
                    }
                ) -> null
              - ref_id         = "A" -> null

              - relative_time_range {
                  - from = 600 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = []
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "B",
                                    ]
                                }
                              - reducer   = {
                                  - params = []
                                  - type   = "last"
                                }
                              - type      = "query"
                            },
                        ]
                      - datasource = {
                          - type = "__expr__"
                          - uid  = "__expr__"
                        }
                      - expression = "A"
                      - hide       = false
                      - reducer    = "last"
                      - refId      = "B"
                      - type       = "reduce"
                    }
                ) -> null
              - ref_id         = "B" -> null

              - relative_time_range {
                  - from = 600 -> null
                  - to   = 0 -> null
                }
            }
          - data {
              - datasource_uid = "__expr__" -> null
              - model          = jsonencode(
                    {
                      - conditions = [
                          - {
                              - evaluator = {
                                  - params = [
                                      - 0,
                                    ]
                                  - type   = "gt"
                                }
                              - operator  = {
                                  - type = "and"
                                }
                              - query     = {
                                  - params = [
                                      - "C",
                                    ]
                                }
                              - reducer   = {
                                  - params = []
                                  - type   = "last"
                                }
                              - type      = "query"
                            },
                        ]
                      - datasource = {
                          - type = "__expr__"
                          - uid  = "__expr__"
                        }
                      - expression = "B"
                      - hide       = false
                      - refId      = "C"
                      - type       = "threshold"
                    }
                ) -> null
              - ref_id         = "C" -> null

              - relative_time_range {
                  - from = 600 -> null
                  - to   = 0 -> null
                }
            }
        }
    }

  # module.ce_folder.grafana_folder.this will be destroyed
  # (because module.ce_folder is not in configuration)
  - resource "grafana_folder" "this" {
      - id                           = "0:b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - org_id                       = "0" -> null
      - prevent_destroy_if_not_empty = false -> null
      - title                        = "Cloud Engineering" -> null
      - uid                          = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - url                          = "https://demo.grafana.dfds.cloud/dashboards/f/b934e728-bb75-170b-83e7-024c5bdd6e61/cloud-engineering" -> null
    }

  # module.ce_folder.random_uuid.this will be destroyed
  # (because module.ce_folder is not in configuration)
  - resource "random_uuid" "this" {
      - id     = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
      - result = "b934e728-bb75-170b-83e7-024c5bdd6e61" -> null
    }

  # module.ce_folder["enabled"].grafana_folder.this will be created
  + resource "grafana_folder" "this" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Cloud Engineering"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

  # module.ce_folder["enabled"].random_uuid.this will be created
  + resource "random_uuid" "this" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:ddfcp482rkiyoe" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "1password"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-1Password" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "ddfcp482rkiyoe" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:cdj0a5m7tqtc0a" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "awsbackupobservability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://aws-backup-dashboards/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-AWS-Backup" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "cdj0a5m7tqtc0a" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrbwyhrnpm9sb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              - authType       = "grafana_assume_role"
              - catalog        = "iam-rolesanywhere-pca-observability"
              - database       = "iam_rolesanywhere_pca_observability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              - workgroup      = "iam-rolesanywhere-pca-observability"
            }
        ) -> null
      - name               = "Athena-IAM-roles-anywhere" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "edrbwyhrnpm9sb" -> null
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "1password"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-1Password"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "awsbackupobservability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://aws-backup-dashboards/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-AWS-Backup"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              + authType       = "grafana_assume_role"
              + catalog        = "iam-rolesanywhere-pca-observability"
              + database       = "iam_rolesanywhere_pca_observability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              + workgroup      = "iam-rolesanywhere-pca-observability"
            }
        )
      + name               = "Athena-IAM-roles-anywhere"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:fdrtfy9dhcm4gd" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "fdrtfy9dhcm4gd" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrtfy9d4v4e8e" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "edrtfy9d4v4e8e" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:fdey90cd04a2oa" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-west-1"
            }
        ) -> null
      - name               = "CloudWatch-oxygen-eu-west-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "fdey90cd04a2oa" -> null
    }

  # module.grafana_data_source_aws_cloudwatch["enabled"].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch["enabled"].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch["enabled"].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-west-1"
            }
        )
      + name               = "CloudWatch-oxygen-eu-west-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_notification.grafana_contact_point.this[0] will be destroyed
  # (because module.grafana_notification is not in configuration)
  - resource "grafana_contact_point" "this" {
      - disable_provenance = false -> null
      - id                 = "0:Cloud Engineering Slack" -> null
      - name               = "Cloud Engineering Slack" -> null
      - org_id             = "0" -> null

      - slack {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.grafana_notification.grafana_notification_policy.this[0] will be destroyed
  # (because module.grafana_notification is not in configuration)
  - resource "grafana_notification_policy" "this" {
      - contact_point      = "grafana-default-email" -> null
      - disable_provenance = true -> null
      - group_by           = [
          - "...",
        ] -> null
      - group_interval     = "5m" -> null
      - group_wait         = "30s" -> null
      - id                 = "0:policy" -> null
      - org_id             = "0" -> null
      - repeat_interval    = "4h" -> null

      - policy {
          - contact_point = "Cloud Engineering Slack" -> null
          - continue      = false -> null
          - group_by      = [
              - "grafana_folder",
            ] -> null
          - mute_timings  = [] -> null

          - matcher {
              - label = "grafana_folder" -> null
              - match = "=" -> null
              - value = "Cloud Engineering" -> null
            }

          - policy {
              - continue        = false -> null
              - group_by        = [
                  - "grafana_folder",
                  - "alertname",
                ] -> null
              - mute_timings    = [] -> null
              - repeat_interval = "1d" -> null

              - matcher {
                  - label = "repeat" -> null
                  - match = "=" -> null
                  - value = "24h" -> null
                }
            }
        }
    }

Plan: 8 to add, 0 to change, 40 to destroy.

Error: Invalid index

  on main.tf line 83, in module "dashboards":
  83:   folder = module.ce_folder[0].id
    ├────────────────
    │ module.ce_folder is object with 1 attribute "enabled"

The given key does not identify an element in this collection value. An
object only supports looking up attributes by name, not by numeric index.
time=2024-08-14T13:57:12Z level=info msg=Encountered an error eligible for retrying. Sleeping 5s before retrying.
 prefix=[/atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-demo-ws-01/environments/demo] 
time=2024-08-14T13:57:17Z level=error msg=1 error occurred:
	* Exhausted retries (3) for command /usr/local/bin/tofu plan -no-color -input=false -out=/atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-demo-ws-01/environments/demo/grafana-cloud-objects-demo-ws-01.tfplan


time=2024-08-14T13:57:17Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1

time=2024-08-14T13:56:27Z level=info msg=Downloading Terraform configurations from file:///atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-demo-ws-01 into /atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-demo-ws-01/environments/demo/.terragrunt-cache/pTdoceW9WVTREjI9koq00UcUxhc/0b3YoIT6oNFKtU3MmQIZMgWk5hA

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.
Upgrading modules...
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for alerts...
- alerts in .terraform/modules/alerts/grafana_alert
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for ce_folder...
- ce_folder in .terraform/modules/ce_folder/grafana_folder
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for dashboards...
- dashboards in .terraform/modules/dashboards/grafana_dashboard
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_data_source_aws_athena...
- grafana_data_source_aws_athena in .terraform/modules/grafana_data_source_aws_athena/grafana_data_source_athena
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_data_source_aws_cloudwatch...
- grafana_data_source_aws_cloudwatch in .terraform/modules/grafana_data_source_aws_cloudwatch/grafana_data_source_cloudwatch
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_notification...
- grafana_notification in .terraform/modules/grafana_notification/grafana_notification

Initializing provider plugins...
- Finding grafana/grafana versions matching ">= 2.9.0"...
- Finding hashicorp/aws versions matching ">= 5.34.0"...
- Finding hashicorp/random versions matching "~> 3.6.0"...
- Installing grafana/grafana v3.7.0...
- Installed grafana/grafana v3.7.0 (signed, key ID 570AA42029AE241A)
- Installing hashicorp/aws v5.62.0...
- Installed hashicorp/aws v5.62.0 (signed, key ID 0C0AF313E5FD9F80)
- Installing hashicorp/random v3.6.2...
- Installed hashicorp/random v3.6.2 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!

```
</details>

---
### 3. dir: `environments/platform` workspace: `grafana-cloud-objects-platform-ws-01`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -no-color --terragrunt-non-interactive -input=false -out=$PLANFILE --terragrunt-source-update" in "/atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01/environments/platform": exit status 1: running "terragrunt plan -no-color --terragrunt-non-interactive -input=false -out=$PLANFILE --terragrunt-source-update" in "/atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01/environments/platform": 
time=2024-08-14T13:57:29Z level=info msg=Downloading Terraform configurations from file:///atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01 into /atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-platform-ws-01/environments/platform/.terragrunt-cache/U54ShdOYLL9xW6-tvbqfARbsodE/9BMdIpBe-O6Z80jvzminapAjLXM

Initializing the backend...

Successfully configured the backend "s3"! OpenTofu will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for alerts...
- alerts in .terraform/modules/alerts/grafana_alert
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for ce_folder...
- ce_folder in .terraform/modules/ce_folder/grafana_folder
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for dashboards...
- dashboards in .terraform/modules/dashboards/grafana_dashboard
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_data_source_aws_athena...
- grafana_data_source_aws_athena in .terraform/modules/grafana_data_source_aws_athena/grafana_data_source_athena
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_data_source_aws_cloudwatch...
- grafana_data_source_aws_cloudwatch in .terraform/modules/grafana_data_source_aws_cloudwatch/grafana_data_source_cloudwatch
Downloading git::https://github.com/dfds/terraform-grafana-cloud.git?ref=2.1.0 for grafana_notification...
- grafana_notification in .terraform/modules/grafana_notification/grafana_notification

Initializing provider plugins...
- Reusing previous version of grafana/grafana from the dependency lock file
- Reusing previous version of hashicorp/random from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.62.0...
- Installed hashicorp/aws v5.62.0 (signed, key ID 0C0AF313E5FD9F80)
- Installing grafana/grafana v3.7.0...
- Installed grafana/grafana v3.7.0 (signed, key ID 570AA42029AE241A)
- Installing hashicorp/random v3.6.2...
- Installed hashicorp/random v3.6.2 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!
module.ce_folder.random_uuid.this: Refreshing state... [id=c3fd8820-e5b7-d60f-de99-4d1231726eed]
data.aws_ssm_parameter.grafana_url: Reading...
data.aws_ssm_parameter.grafana_sa_access_token: Reading...
data.aws_ssm_parameter.grafana_url: Read complete after 0s [id=/grafana-cloud/dfdsplatformservices/stack-url]
data.aws_ssm_parameter.grafana_sa_access_token: Read complete after 0s [id=/grafana-cloud/dfdsplatformservices/terraform-sa-access-token]
module.ce_folder.grafana_folder.this: Refreshing state... [id=0:c3fd8820-e5b7-d60f-de99-4d1231726eed]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"]: Refreshing state... [id=1:edrbwxzugq7eob]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"]: Refreshing state... [id=1:ddor6qshlvgu8d]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"]: Refreshing state... [id=1:ddp232mqi6pdsb]
module.grafana_notification.grafana_contact_point.this[0]: Refreshing state... [id=0:Cloud Engineering Slack]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"]: Refreshing state... [id=1:adrtfydetni0wb]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"]: Refreshing state... [id=1:edrtfydh1oagwb]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"]: Refreshing state... [id=1:edp232mk1y58gc]
module.grafana_notification.grafana_notification_policy.this[0]: Refreshing state... [id=0:policy]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu planned the following actions, but then encountered a problem:

  # module.ce_folder.grafana_folder.this will be destroyed
  # (because module.ce_folder is not in configuration)
  - resource "grafana_folder" "this" {
      - id                           = "0:c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - org_id                       = "0" -> null
      - prevent_destroy_if_not_empty = false -> null
      - title                        = "Cloud Engineering" -> null
      - uid                          = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - url                          = "https://platform.grafana.dfds.cloud/dashboards/f/c3fd8820-e5b7-d60f-de99-4d1231726eed/cloud-engineering" -> null
    }

  # module.ce_folder.random_uuid.this will be destroyed
  # (because module.ce_folder is not in configuration)
  - resource "random_uuid" "this" {
      - id     = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
      - result = "c3fd8820-e5b7-d60f-de99-4d1231726eed" -> null
    }

  # module.ce_folder["enabled"].grafana_folder.this will be created
  + resource "grafana_folder" "this" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Cloud Engineering"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

  # module.ce_folder["enabled"].random_uuid.this will be created
  + resource "random_uuid" "this" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:ddp232mqi6pdsb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "1password"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-1Password" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "ddp232mqi6pdsb" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:ddor6qshlvgu8d" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "awsbackupobservability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://aws-backup-dashboards/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-AWS-Backup" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "ddor6qshlvgu8d" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrbwxzugq7eob" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              - authType       = "grafana_assume_role"
              - catalog        = "iam-rolesanywhere-pca-observability"
              - database       = "iam_rolesanywhere_pca_observability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              - workgroup      = "iam-rolesanywhere-pca-observability"
            }
        ) -> null
      - name               = "Athena-IAM-roles-anywhere" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "edrbwxzugq7eob" -> null
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "1password"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-1Password"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "awsbackupobservability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://aws-backup-dashboards/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-AWS-Backup"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              + authType       = "grafana_assume_role"
              + catalog        = "iam-rolesanywhere-pca-observability"
              + database       = "iam_rolesanywhere_pca_observability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              + workgroup      = "iam-rolesanywhere-pca-observability"
            }
        )
      + name               = "Athena-IAM-roles-anywhere"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrtfydh1oagwb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "edrtfydh1oagwb" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:adrtfydetni0wb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "adrtfydetni0wb" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edp232mk1y58gc" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-west-1"
            }
        ) -> null
      - name               = "CloudWatch-oxygen-eu-west-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "edp232mk1y58gc" -> null
    }

  # module.grafana_data_source_aws_cloudwatch["enabled"].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch["enabled"].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name   
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.